{
  "name": "Christian D'Albano",
  "title": "Software Developer",
  "contact": {
    "email": "chrisdalbano12@gmail.com",
    "linkedin": "https://linkedin.com/in/chrisdalb",
    "phone": "407-449-0746",
    "github": "https://github.com/chrisdalbano",
    "location": "Orlando, FL",
    "website": "https://chrisdalbano.com"
  },
  "summary": "Passionate creative developer with strong expertise in modern JavaScript frameworks and a proven track record of building performant, beautiful, usable and scalable web applications. Experienced in delivering pixel-perfect UI/UX designs, optimizing performance, and working with cross-functional teams to bring product ideas to life. Proficient in React, TypeScript, Vue.js, and integrating front-end interfaces with complex back-end systems. Passionate about building user-friendly interfaces and driving code quality through best practices.",
  "technical_proficiency": {
    "frontend_development": "React, TypeScript, Vue.js, HTML5, JavaScript (ES6+), CSS3, Tailwind CSS, SASS, Webpack, Vite, Figma, styled-components",
    "backend_development": "Node.js, Java, Spring Boot, RESTful APIs, GraphQL",
    "database_technologies": "PostgreSQL, MongoDB, Firebase, Supabase, NoSQL",
    "cloud_technologies": "Microsoft Azure, GCP, Docker, Kubernetes, CI/CD pipelines",
    "tools_platforms": "Git, GitHub, Jenkins, Figma, Adobe XD, Jira, Webpack, Gulp, Grunt"
  },
  "experience": [
    {
      "position": "Software Developer",
      "company": "Mouseflow",
      "location": "Remote - Orlando, FL",
      "dates": "Aug 2023 - Present",
      "responsibilities": [
        "Develop and maintain front-end automation scripts using React and TypeScript to enhance troubleshooting and streamline the support process for web applications.",
        "Collaborate with back-end teams to integrate API-based services, ensuring efficient communication between front-end systems and back-end services.",
        "Work closely with front-end teams to debug and optimize Vue.js and React-based interfaces, improving performance and UX across various projects.",
        "Build and optimize custom user interfaces, driving a 40% improvement in performance and reducing manual support workload through automation."
      ],
      "technologies": "React, TypeScript, Vue.js, REST APIs, Git, Webpack, Java"
    },
    {
      "position": "Junior Frontend Developer",
      "company": "Baptist Health South Florida",
      "location": "Remote - Miami, FL",
      "dates": "Jun 2022 - Aug 2023",
      "responsibilities": [
        "Developed responsive and user-friendly interfaces for a large-scale patient portal using React and TypeScript, improving user experience and reducing response times by 20%.",
        "Integrated front-end components with Java-based back-end microservices to ensure seamless API consumption and data exchange.",
        "Collaborated closely with designers to implement pixel-perfect UI/UX designs using Figma and styled-components."
      ],
      "technologies": "React, TypeScript, Java, Azure, PostgreSQL, RESTful APIs, Figma"
    },
    {
      "position": "Full-Stack Developer",
      "company": "Aizhak Coffee (Contract)",
      "location": "Remote",
      "dates": "Sep 2023 - Jan 2024",
      "responsibilities": [
        "Designed and implemented a scalable Vue.js front-end for a custom eCommerce platform, optimizing performance for real-time updates and high traffic.",
        "Collaborated with back-end developers to integrate Vue.js front-end components with Node.js microservices, ensuring smooth API consumption.",
        "Led the integration of Figma designs into a fully responsive front-end experience using TypeScript, increasing customer engagement by 50%."
      ],
      "technologies": "Vue.js, React, TypeScript, Node.js, Firebase, Azure, Webpack, Figma"
    },
    {
      "position": "Frontend Developer Intern",
      "company": "BudgetWise (Internship)",
      "location": "Remote",
      "dates": "Oct 2022 - Jan 2023",
      "responsibilities": [
        "Developed front-end features using Vue.js and TypeScript, focusing on responsive design and performance optimization.",
        "Collaborated with back-end teams to integrate Vue.js components with Java-based microservices, contributing to a scalable eCommerce platform.",
        "Worked closely with UI/UX designers to implement Figma-based designs into the Vue.js front-end, following best practices in responsive and performant web design."
      ],
      "technologies": "Vue.js, TypeScript, Java, Firebase, Docker, Webpack, Figma"
    }
  ],
  "projects": [
    {
      "title": "Aizhak Coffee E-Commerce Platform",
      "url": "https://aizhak.com",
      "description": "Led front-end development using Vue.js for a dynamic eCommerce platform. Integrated real-time inventory management and collaborated with back-end teams to ensure seamless API integration with Java microservices.",
      "technologies": "Vue.js, TypeScript, Firebase, Java, Docker, Figma"
    },
    {
      "title": "QuizMEGPT Web Application",
      "url": "https://quizmegpt.chrisdalbano.com",
      "description": "Developed a scalable AI-based web application for quiz generation using React and Firebase. Integrated RESTful services and optimized performance by 30% through efficient API consumption and front-end optimizations.",
      "technologies": "React, TypeScript, Firebase, GPT-3 API, Docker, Kubernetes"
    },

    {
      "title": "MTGen Web Application",
      "url": "https://mtgen.chrisdalbano.com",
      "description": "Built a Magic The Gathering card generator with React and integrated real-time API services. Optimized performance for high traffic using Webpack and Firebase functions.",
      "technologies": "React, TypeScript, Firebase, Node.js, Webpack"
    }
  ],
  "education": [
    {
      "degree": "B.A.S Computing Technology and Software Development",
      "institution": "Valencia College",
      "dates": "2023 - 2024"
    },
    {
      "degree": "A.S Computer Programming and Analysis",
      "institution": "Valencia College",
      "dates": "2020 - 2023"
    }
  ],
  "additional_experience": [
    {
      "position": "Frontend Developer",
      "company": "Freelance",
      "dates": "Feb 2019 - Present",
      "responsibilities": [
        "Worked with clients to build responsive and scalable web applications, leveraging React, Vue.js, HTML5, and CSS3.",
        "Collaborated with back-end developers to integrate front-end components with various technologies, including Java-based services and Node.js.",
        "Optimized front-end code for performance, accessibility, and scalability, following best practices in web development."
      ],
      "technologies": "React, Vue.js, TypeScript, HTML5, CSS3, Java, Git"
    }
  ],
  "skills": [
    "React Development",
    "Vue.js Development",
    "TypeScript",
    "UI/UX Collaboration (Figma, Adobe XD)",
    "JavaScript (ES6+)",
    "Scalable API Development",
    "RESTful & GraphQL API Design",
    "Responsive Design Principles",
    "Webpack, Gulp, Grunt, Vite",
    "Cloud-Native Development (Azure, GCP, Firebase)",
    "Cross-Functional Team Collaboration",
    "E-Commerce Platform Development",
    "styled-components"
  ]
}
