{
  "name": "Christian D'Albano",
  "title": "Software Developer | eCommerce & API",
  "contact": {
    "email": "chrisdalbano12@gmail.com",
    "linkedin": "https://linkedin.com/in/chrisdalb",
    "phone": "407-449-0746",
    "github": "https://github.com/chrisdalbano",
    "location": "Orlando, FL",
    "website": "https://chrisdalbano.com"
  },
  "summary": "Creative Software Developer with 3+ years of experience building highly scalable, web applications, microservices, and contributing to diverse eCommerce platforms. Proficient in designing and implementing UI, RESTful services, and API-driven solutions. Adept at solving complex software systems issues with a focus on reliability, scalability, and performance optimization. Seeking to apply my expertise to next-generation affiliate modern solutions and social commerce experiences.",
  "technical_proficiency": {
    "frontend_development": "HTML5, JavaScript, CSS3, React, Redux, Vue, Nuxt, Tailwind CSS, SASS",
    "backend_development": "Node.js, Java, Python, Spring Boot, Django, Flask, RESTful APIs, GraphQL",
    "database_technologies": "MySQL, PostgreSQL, MongoDB, Firebase, Supabase, NoSQL",
    "cloud_technologies": "Microsoft Azure, GCP, Docker, Kubernetes, CI/CD pipelines",
    "tools_platforms": "Git, GitHub, Jenkins, ServiceNow, Jira, Figma, Adobe XD, Wordpress, Shopify"
  },
  "experience": [
    {
      "position": "Software Developer",
      "company": "Mouseflow",
      "location": "Remote - Orlando, FL",
      "dates": "Aug 2023 - Present",
      "responsibilities": [
        "Contributed to development and integration of highly scalable APIs and web services to support Mouseflow's analytics and eCommerce offerings, ensuring 99.9% uptime and high performance under heavy traffic.",
        "Collaborated with cross-functional teams to implement event-driven interfaces, features and API integrations for key social commerce platforms, enhancing real-time data processing and reducing load times by 40%.",
        "Authored comprehensive technical documentation and knowledge base entries to support user onboarding and reduce support inquiries."
      ],
      "technologies": "JavaScript, HTML5, CSS3, Vue, Node.js, GCP, Jenkins, Jira"
    },
    {
      "position": "Software Engineer",
      "company": "Baptist Health South Florida",
      "location": "Remote - Miami, FL",
      "dates": "Jun 2022 - Aug 2023",
      "responsibilities": [
        "Developed and maintained scalable eCommerce solutions for the patient portal, leveraging RESTful services, Java, and Node.js.",
        "Led the migration to cloud-native microservices on Azure, improving scalability and system reliability for thousands of concurrent users.",
        "Optimized API performance, reducing response times by 20% and ensuring seamless integration with third-party SaaS solutions.",
        "Designed and implemented real-time data processing pipelines using Kafka, improving user interaction tracking and analytics capabilities.",
        "Collaborated with cross-functional teams, including product and DevOps, to ensure the on-time delivery of critical features."
      ],
      "technologies": "Java, Node.js, Azure, RESTful APIs, Kafka, GraphQL, PostgreSQL, MongoDB, Docker, Kubernetes"
    }
  ],
  "projects": [
    {
      "title": "QuizMEGPT Web Application",
      "url": "https://quizmegpt.chrisdalbano.com",
      "description": "Developed a highly scalable AI-based web application for quiz generation, utilizing the GPT-3 API and Firebase. Built with cloud-native principles and deployed using Firebase Functions and Node.js to handle real-time user traffic. Achieved a 30% increase in performance by optimizing API calls and data handling pipelines.",
      "technologies": "Vue.js, Firebase, Node.js, GPT-3 API, Docker, Kubernetes"
    },
    {
      "title": "Aizhak Coffee E-Commerce Platform",
      "url": "https://aizhak.com",
      "description": "Designed and implemented a comprehensive e-commerce platform using Vue.js and Firebase. Utilized Azure cloud services to scale the backend and optimize data pipelines for real-time inventory management and customer analytics. Integrated SendGrid for transactional emails and SEO strategies to drive traffic, leading to a 50% boost in sales.",
      "technologies": "Vue.js, Firebase, Azure, Node.js, SendGrid, Docker"
    },
    {
      "title": "MTGen Web Application",
      "url": "https://mtgen.chrisdalbano.com",
      "description": "Built a Magic The Gathering card generator with a highly scalable REST API platform, powered by DALL-E and GPT-3. Integrated complex real-time user requests processing with Node.js, Firebase, and Google Cloud Functions, ensuring efficient handling of heavy traffic and data loads.",
      "technologies": "Vue.js, Firebase, Node.js, Google Cloud Functions, DALL-E, GPT-3 API"
    },
    {
      "title": "HasteCV Flask Web Application",
      "url": "https://github.com/Chrisdalbano/hastecv",
      "description": "Developed a Vue-based full-stack application with Flask backend to automate CV generation. Built with a scalable API-driven architecture to support heavy traffic and real-time document processing using Docker and Kubernetes.",
      "technologies": "Python, Flask, Vue, Docker, Kubernetes, Jenkins"
    }
  ],
  "education": [
    {
      "degree": "B.A.S Computing Technology and Software Development",
      "institution": "Valencia College",
      "dates": "2023 - 2024"
    },
    {
      "degree": "A.S Computer Programming and Analysis",
      "institution": "Valencia College",
      "dates": "2020 - 2023"
    }
  ],
  "additional_experience": [
    {
      "position": "Full-Stack Developer",
      "company": "Aizhak Coffee (Contract)",
      "dates": "Sep 2023 - Jan 2024",
      "responsibilities": [
        "Led the development of a scalable eCommerce platform with cloud-native microservices, improving sales conversions by 50%.",
        "Implemented API-driven architecture using Vue.js and Firebase, optimizing backend services for real-time updates and efficient data handling.",
        "Utilized SendGrid for transactional email automation and SEO best practices to enhance customer engagement."
      ],
      "technologies": "Vue.js, Firebase, Node.js, Azure, SendGrid, Docker"
    },
    {
      "position": "Full Stack Developer Intern",
      "company": "BudgetWise (Internship)",
      "dates": "Oct 2022 - Jan 2023",
      "responsibilities": [
        "Built key features for an eCommerce platform with Vue.js and Firebase, optimizing performance and scalability to handle real-time user traffic.",
        "Collaborated in an Agile team to deliver cloud-native services, ensuring CI/CD pipelines for continuous deployment and monitoring."
      ],
      "technologies": "Vue.js, Typescript, Firebase, Docker, Kubernetes, Agile methodologies"
    }
  ],
  "skills": [
    "Scalable API Development",
    "Microservices Architecture",
    "Event-Driven Architecture",
    "Cloud-Native Development (Azure, AWS, GCP)",
    "Kafka & Real-Time Data Pipelines",
    "RESTful & GraphQL API Design",
    "Big Data Technologies (Spark, Hadoop, Elasticsearch)",
    "CI/CD Automation (Jenkins, Docker, Kubernetes)",
    "Cross-Functional Team Leadership",
    "E-Commerce Platform Development",
    "Production System Monitoring & Optimization"
  ]
}
